Repository: nathanaeli/stockflowkp
Catalog: lib/l10n/app_*.arb
Languages: sw

# appTitle
source: SmartBiz
sw: StockFlowKp

# subtitle
source: Manage your business like a pro. Sales • Inventory • Customers • Reports
sw: Simamia biashara yako kama mtaalamu. Mauzo • Hesabu • Wateja • Ripoti

# enterButton
source: Enter SmartBiz
sw: Ingia StockFlowKp

source: Email
sw: Barua pepe

source: Password
sw: Nenosiri

source: Login
sw: Ingia

# enterEmail
source: Enter your email
sw: Ingiza barua pepe yako

# enterPassword
source: Enter your password
sw: Ingiza nenosiri lako

source: Login failed
sw: Kuingia kumeshindikana

source: Login successful
sw: Kuingia kufanikiwa

# helloOfficer
source: Hello, {name} 👋
sw: Halo, {name} 👋

# readyForTasks
source: Ready for today's tasks?
sw: Je, tayari kwa kazi za leo?

source: Today's Sales
sw: Mauzo ya Leo

source: Unsynced
sw: Haijaunganishwa

source: Low Stock
sw: Hifadhi Ndogo

source: Home
sw: Nyumbani

source: Analytics
sw: Takwimu

source: products
sw: bidhaa

source: Clients
sw: Wateja

source: Dashboard
sw: Dashibodi

source: Pending Sales
sw: Mauzo yanayosubiri

source: Check Stock
sw: Angalia Hifadhi

source: Activity Log
sw: Kumbukumbu ya Shughuli

source: Barcode Generator
sw: Kichapishaji cha Barcode

source: Backup & Restore
sw: Hifadhi & Rudisha

# howToUse
source: How to use it
sw: Jinsi ya kuitumia

source: Support
sw: Msaada

source: Sign Out
sw: Toka

source: New Sale
sw: Mauzo Mapya

source: Sales
sw: Mauzo

source: Categories
sw: Vikundi

source: Permissions
sw: Idhini

source: Customers
sw: Wateja

source: My Company
sw: Kampuni Yangu

source: Invoices
sw: Pesi

source: Unsynced Data
sw: Data Haijaunganishwa

# unsyncedWarning
source: You have {count} pending items that haven't been synced yet. Signing out now will delete this data permanently.
sw: Una kitu {count} kinachosubiri ambacho bakijaunganishwa. Kutoka sasa itafuta data hii kila mmoja.

source: Cancel
sw: Ghairi

source: Delete & Sign Out
sw: Futa & Toka

source: Sync & Sign Out
sw: Unganisha & Toka

# confirmSignOut
source: Are you sure you want to sign out? All local data will be cleared.
sw: Je, una uhakika unataka kutoka? Data zote za ndani zitafutwa.

# syncSuccessful
source: Sync successful! Signing out...
sw: Uunganishaji umefanikiwa! Kutoa...

# syncFailed
source: Sync failed. {count} items remaining.
sw: Uunganishaji umeshindikana. Vitu {count} vimebaki.

# syncError
source: Sync error: {error}
sw: Hitilafu ya uunganishaji: {error}

# lowStockAlert
source: ⚠️ Alert: {count} products are low on stock!
sw: ⚠️ Onyo: Bidhaa {count} zina hifadhi ndogo!

source: VIEW
sw: ANGALIA

# logoutFailed
source: Logout failed: {error}
sw: Kutoa kumeshindikana: {error}

source: Officer
sw: Mwanajeshi

# defaultEmail
source: email@example.com
sw: barua.pepe@mfano.com

source: Manage Products
sw: Simamia Bidhaa

source: items
sw: vitu

source: item
sw: kitu

source: Search products...
sw: Tafuta bidhaa...

source: No products yet
sw: Bado hakuna bidhaa

# tapAddFirstProduct
source: Tap + to add your first product
sw: Gonga + kuongeza bidhaa yako ya kwanza

source: No products found
sw: Hakuna bidhaa zilizopatikana

# tryDifferentSearch
source: Try a different search term
sw: Jaribu neno la utafutaji tofauti

# scanProductBarcode
source: Scan product barcode to search
sw: Changanua barcode ya bidhaa kutafuta

source: Scan
sw: Changanua

source: Add Product
sw: Ongeza Bidhaa

source: LOCAL
sw: MAELEZO

source: Description
sw: Maelezo

source: No description
sw: Hakuna maelezo

source: available
sw: Inapatikana

source: Failed to load products
sw: Kushindwa kupakia bidhaa

source: Product deleted successfully
sw: Bidhaa imefutwa kwa mafanikio

source: Failed to delete product
sw: Kushindwa kufuta bidhaa

source: Delete Product
sw: Futa Bidhaa

# areYouSureDeleteProduct
source: Are you sure you want to delete "{name}"? This action cannot be undone.
sw: Je, una uhakika unataka kufuta "{name}"? Hatua hii haiwezi kubadilishwa.

source: Delete
sw: Futa

source: View Stock
sw: Angalia Hifadhi

source: Stock Info
sw: Maelezo ya Hifadhi

source: Product Type
sw: Aina ya Bidhaa

source: Online
sw: Mtandaoni

source: Offline
sw: Nje ya mtandao

source: Bulk Stock
sw: Hifadhi ya Wingi

source: Tracked Items (available)
sw: Vitu vinavyofuatwa (vinavyopatikana)

source: Total Available
sw: Jumla Inapatikana

source: Close
sw: Funga

source: Could not load stock details
sw: Haikuweza kupakia maelezo ya hifadhi

source: Add Product Item
sw: Ongeza Kitu cha Bidhaa

source: Debug Information
sw: Maelezo ya Utatuzi

# debugInfoPrinted
source: Debug information has been printed to the console.
sw: Maelezo ya utatuzi yamechapishwa kwa koni.

# checkConsoleOutput
source: Check the console output for detailed information about:
sw: Angalia matokeo ya koni kwa maelezo ya kina kuhusu:

# userAuthDataStructure
source: User authentication data structure
sw: Muundo wa data ya uthibitishaji wa mtumiaji

# tokenLocationFormat
source: Token location and format
sw: Mahali na muundo wa tokeni

source: Pending products status
sw: Hali ya bidhaa zinazosubiri

# databaseSyncState
source: Database synchronization state
sw: Hali ya uunganishaji wa hifadhidata

# informationHelpTroubleshoot
source: This information will help troubleshoot sync issues.
sw: Maelezo haya yatasaidia kutatua matatizo ya uunganishaji.

source: OK
sw: Sawa

source: Sort
sw: Panga

source: Name
sw: Jina

source: Price
sw: Bei

source: Sync pending products
sw: Unganisha bidhaa zinazosubiri

source: Syncing...
sw: Inaunganisha...

source: Sync
sw: Unganisha

source: Debug sync issues
sw: Utatuzi wa matatizo ya uunganishaji

# successfullySyncedProducts
source: Successfully synced {count} product{countPlural}
sw: Imefanikiwa kuunganisha bidhaa {count}

source: product
sw: bidhaa

# failedToSyncProducts
source: {count} product{countPlural} failed to sync
sw: Bidhaa {count} zimeshindikana kuunganishwa

source: No products to sync
sw: Hakuna bidhaa za kuunganisha

source: Sync failed: {message}
sw: Uunganishaji umeshindikana: {message}

# syncErrorMessage
source: Sync error: {error}
sw: Hitilafu ya uunganishaji: {error}

source: left
sw: imesalia

source: Sale Details
sw: Maelezo ya Mauzo

source: Items Purchased
sw: Vitu Vilivyotumwa

source: Customer
sw: Mteja

source: Refresh
sw: Sasisha

source: Invoice
sw: Pesi

source: Invoice Ready
sw: Pesi Tayari

source: Print Invoice
sw: Chapisha Pesi

source: Email Invoice
sw: Tuma Pesi Barua Pepe

source: PAID
sw: IMALIPWA

source: LOAN
sw: MKOPO

source: Subtotal
sw: Jumla ndogo

source: Discount
sw: Punguzo

source: Total Amount
sw: Jumla ya Mwisho

source: Error sharing invoice
sw: Hitilafu ya kushirikisha pesi

source: Dear Customer
sw: Mpendwa Mteja

# invoiceEmailBody
source: Please find attached the invoice for your recent purchase. Thank you for shopping with us!
sw: Tafadhali attach pesi kwa ununuzi wako wa hivi karibuni. Asante kwa kununua nasi!

# invoicePdfTitle
source: INVOICE
sw: PESI

source: Bill To:
sw: Lipa kwa:

source: Item Description
sw: Maelezo ya Kitu

source: Qty
sw: Idadi

source: Unit Price
sw: Bei ya Kila

source: Total
sw: Jumla

# totalAmountPdf
source: TOTAL AMOUNT
sw: JUMLA YA MWISHO

# thankYouChoosing
source: Thank you for choosing {company}!
sw: Asante kwa kuchagua {company}!

# generatedOn
source: Generated on {date}
sw: Imeundwa {date}

source: Tel:
sw: Simu:

# emailLabel
source: Email:
sw: Barua pepe:

source: Walk-in Customer
sw: Mteja wa Duka

# cashSale
source: Cash Sale • No specific address provided
sw: Mauzi ya Fedha Taslimu • Hakuna anwani maalum iliyotolewa

source: Registered Customer
sw: Mteja Aliyesajiliwa

# itemsCount
source: {count} Items
sw: Vitu {count}

source: Unknown Product
sw: Bidhaa Isiyojulikana

source: Unnamed Item
sw: Kisiwa Kisicho na Jina

source: Unknown
sw: Haijulikani

source: Walk-in Sale
sw: Mauzi ya Duka

source: Sales Analytics
sw: Takwimu za Mauzo

source: Last 7 Days Overview
sw: Muhtasari wa Siku 7

source: Total Revenue
sw: Jumla ya Mapato

source: Total Sales
sw: Jumla ya Mauzo

source: Date
sw: Tarehe

source: Day
sw: Siku

source: Sales Count
sw: Idadi ya Mauzo

source: Revenue Trend
sw: Mwelekeo wa Mapato

source: Weekly
sw: Wiki

source: Daily Breakdown
sw: Mgawanyiko wa Kila Siku

source: Sales by Category
sw: Mauzo kwa Kikundi

source: Top Selling Products
sw: Bidhaa Zinazouzwa Zaidi

source: Top Products (Selected Category)
sw: Bidhaa zaidi (Kikundi Kilichochaguliwa)

source: Uncategorized
sw: Isiyokuwa na Kikundi

source: No category data available
sw: Hakuna data za kikundi

source: No sales data available
sw: Hakuna data za mauzo

source: units sold
sw: vitu vimeuzwa

source: Sales Summary Report
sw: Ripoti ya Muhtasari wa Mauzo

source: Last 7 Days Performance
sw: Utendaji wa Siku 7

source: Error exporting Excel
sw: Hitilafu ya kuuza Excel

source: Select Range
sw: Chagua Kipindi

source: vs
sw: dhidi ya

# allSalesSynced
source: All sales are synced
sw: Mauzo yote yameunganishwa

source: Sync Now
sw: Unganisha Sasa

source: Sync All
sw: Unganisha Yote

source: Sale synced successfully
sw: Mauzo yameunganishwa kwa mafanikio

# syncFailedWithMessage
source: Sync failed: {message}
sw: Uunganishaji umeshindikana: {message}

# errorWithMessage
source: Error: {error}
sw: Hitilafu: {error}

# syncedCountOfTotal
source: Synced {count} of {total} sales
sw: Yameunganishwa {count} kati ya {total} ya mauzo

source: Not authenticated
sw: Haijaithibitishwa

source: Financial Overview
sw: Mapitio ya Kifedha

source: Est. Profit
sw: Faida Iliyokadiriwa

source: Expenses
sw: Gharama

source: Net Income
sw: Mapato Halisi

source: Business & Inventory
sw: Biashara na Mali

source: Total Products
sw: Jumla ya Bidhaa

source: Account Balance
sw: Salio la Akaunti

source: Stock Value (Cost)
sw: Thamani ya Mali (Gharama)

source: Today's Performance by Shop
sw: Utendaji wa Leo kwa Duka

source: All Shops
sw: Maduka Yote

source: Tenant Name
sw: Jina la Mpangaji

source: Role
sw: Wadhifa

source: Joined
sw: Amejiunga

source: Edit Profile
sw: Hariri Wasifu

source: My Shops
sw: Maduka Yangu

source: Profile
sw: Wasifu

source: Settings
sw: Mipangilio

source: Server Sync
sw: Usawazishaji wa Seva

source: Today Sales
sw: Mauzo ya Leo

source: Today Profit
sw: Faida ya Leo

source: Shop Settings
sw: Mipangilio ya Duka

source: View Full Report
sw: Angalia Ripoti Kamili

source: Management
sw: Usimamizi

source: Performance Today
sw: Utendaji wa Leo

source: Stock Count
sw: Idadi ya Mali

# created
source: Created At
sw: Imeundwa

# noShopActivity
source: No shop activity recorded today
sw: Hakuna shughuli za duka zilizorekodiwa leo

source: Retry Connection
sw: Jaribu Kuunganisha Tena

source: Something went wrong
sw: Kuna hitilafu imetokea

source: Select Language
sw: Chagua Lugha

source: Inventory
sw: Mali

source: Refresh Inventory
sw: Sasisha Mali

source: Cost Price
sw: Bei ya Kununua

source: Selling Price
sw: Bei ya Kuuza

source: MARGIN
sw: FAIDA

source: Waiting for sync...
sw: inasubiri kuunganishwa...

source: No Local Products Found
sw: Hakuna Mali Iliyopatikana

# addProductsOrSync
source: Add products or sync from server
sw: Ongeza bidhaa au unganisha kutoka kwa seva

# profitAndLoss
source: Profit & Loss
sw: Faida na Hasara

source: Manage Officers
sw: Dhibiti Maafisa

source: Product Categories
sw: Aina za Bidhaa

source: Transactions Report
sw: Ripoti ya Mauzo

# inventoryAndAging
source: Inventory & Aging
sw: Mali na Uchakavu

source: Register New Shop
sw: Sajili Duka Jipya

source: Feature coming soon
sw: Kipengele hiki kinakuja hivi karibuni
